app/Controllers/Admin.php

SELECT *
FROM `campaigns`
---
public function campaigns()
{
    $db = \Config\Database::connect();

    $builder = $db->table('campaigns');
    $campaigns = $builder->get()->getResult();

SELECT *
FROM `donations`
WHERE `id` = '3'
UPDATE `donations` SET `status` = 'approved'
WHERE `id` = '3'
UPDATE `campaigns` SET `current_amount` = current_amount + 300.00
WHERE `id` = '3'
---
public function approve($id)
{
    $db = \Config\Database::connect();

    // get donation
    $donation = $db->table('donations')
                   ->where('id', $id)
                   ->get()
                   ->getRow();

    if(!$donation){
        return redirect()->to('/admin/donations');
    }

    // update donation status
    $db->table('donations')
       ->where('id', $id)
       ->update(['status' => 'approved']);

    // add amount to campaign total
    $db->table('campaigns')
       ->set('current_amount', 'current_amount + '.$donation->amount, false)
       ->where('id', $donation->campaign_id)
       ->update();

DELETE FROM `campaigns`
WHERE `id` = '2'
---
public function deleteCampaign($id)
{
    $db = \Config\Database::connect();

    $builder = $db->table('campaigns');

    $builder->where('id',$id)->delete();