app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `campaigns`
SELECT COUNT(*) AS `numrows`
FROM `donations`
SELECT COUNT(*) AS `numrows`
FROM `donations`
WHERE `status` = 'pending'
SELECT `donations`.*, `campaigns`.`title`
FROM `donations`
JOIN `campaigns` ON `campaigns`.`id` = `donations`.`campaign_id`
SELECT *
FROM `campaigns`
SELECT SUM(`donations`.`amount`) AS `amount`
FROM `donations`
JOIN `campaigns` ON `campaigns`.`id` = `donations`.`campaign_id`
WHERE `donations`.`status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `donations`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `donations`
WHERE `status` = 'rejected'
SELECT COUNT(*) AS `numrows`
FROM `users`
---
public function index()
{
    $db = \Config\Database::connect();

    $this->ensureUserActivityColumn($db);

    $campaignBuilder = $db->table('campaigns');
    $totalCampaigns = $campaignBuilder->countAllResults();

    $donationBuilder = $db->table('donations');
    $totalDonations = $donationBuilder->countAllResults();

    $pendingBuilder = $db->table('donations');
    $pendingBuilder->where('status','pending');
    $pendingDonations = $pendingBuilder->countAllResults();

    $approvedBuilder = $db->table('donations');
    $approvedBuilder->selectSum('donations.amount', 'amount');
    $approvedBuilder->join('campaigns', 'campaigns.id = donations.campaign_id');
    $approvedBuilder->where('donations.status', 'approved');
    $approvedAmountRow = $approvedBuilder->get()->getRow();
    $totalMoneyGathered = (float) ($approvedAmountRow->amount ?? 0);

    $approvedCountBuilder = $db->table('donations');
    $approvedCountBuilder->where('status', 'approved');
    $approvedDonations = $approvedCountBuilder->countAllResults();

    $rejectedCountBuilder = $db->table('donations');
    $rejectedCountBuilder->where('status', 'rejected');
    $rejectedDonations = $rejectedCountBuilder->countAllResults();

    $userFields = $db->getFieldNames('users');
    $userBuilder = $db->table('users');
    $totalUsers = $userBuilder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_active` = 0
SELECT campaigns.title, COUNT(donations.id) as donation_count, COALESCE(SUM(CASE WHEN donations.status = 'approved' THEN donations.amount ELSE 0 END), 0) as approved_total
FROM `campaigns`
LEFT JOIN `donations` ON `donations`.`campaign_id` = `campaigns`.`id`
GROUP BY `campaigns`.`id`, `campaigns`.`title`
ORDER BY `approved_total` DESC
 LIMIT 5
---
    if (in_array('is_active', $userFields, true)) {
        $activeBuilder = $db->table('users');
        $activeBuilder->where('is_active', 1);
        $activeUsers = $activeBuilder->countAllResults();

        $disabledBuilder = $db->table('users');
        $disabledBuilder->where('is_active', 0);
        $disabledUsers = $disabledBuilder->countAllResults();
    }

    $topCampaigns = $db->table('campaigns')
        ->select("campaigns.title, COUNT(donations.id) as donation_count, COALESCE(SUM(CASE WHEN donations.status = 'approved' THEN donations.amount ELSE 0 END), 0) as approved_total", false)
        ->join('donations', 'donations.campaign_id = campaigns.id', 'left')
        ->groupBy('campaigns.id, campaigns.title')
        ->orderBy('approved_total', 'DESC')
        ->limit(5)
        ->get()
        ->getResult();

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT `id`, `name`, `email`, `role`, `is_verified`, `is_active`
FROM `users`
ORDER BY `id` DESC
 LIMIT 15
---
public function users()
{
    $db = \Config\Database::connect();

    $this->ensureUserActivityColumn($db);
    $this->ensureRoleColumn($db);

    $perPage = 15;
    $page    = (int) ($this->request->getGet('page') ?? 1);
    if ($page < 1) $page = 1;

    $total      = $db->table('users')->countAllResults();
    $totalPages = max(1, (int) ceil($total / $perPage));
    if ($page > $totalPages) $page = $totalPages;

    $users = $db->table('users')
        ->select('id, name, email, role, is_verified, is_active')
        ->orderBy('id', 'DESC')
        ->limit($perPage, ($page - 1) * $perPage)
        ->get()
        ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `donations`
SELECT `donations`.*, `campaigns`.`title`
FROM `donations`
JOIN `campaigns` ON `campaigns`.`id` = `donations`.`campaign_id`
ORDER BY `donations`.`id` DESC
 LIMIT 15
---
public function donations()
{
    $db      = \Config\Database::connect();
    $perPage = 15;
    $page    = (int) ($this->request->getGet('page') ?? 1);
    if ($page < 1) $page = 1;

    $total = $db->table('donations')->countAllResults();
    $totalPages = max(1, (int) ceil($total / $perPage));
    if ($page > $totalPages) $page = $totalPages;

    $builder = $db->table('donations');
    $builder->select('donations.*, campaigns.title');
    $builder->join('campaigns', 'campaigns.id = donations.campaign_id');
    $builder->orderBy('donations.id', 'DESC');
    $builder->limit($perPage, ($page - 1) * $perPage);

    $data['donations']   = $builder->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `campaigns`
SELECT *
FROM `campaigns`
ORDER BY `id` DESC
 LIMIT 15
---
public function campaigns()
{
    $db      = \Config\Database::connect();
    $perPage = 15;
    $page    = (int) ($this->request->getGet('page') ?? 1);
    if ($page < 1) $page = 1;

    $total      = $db->table('campaigns')->countAllResults();
    $totalPages = max(1, (int) ceil($total / $perPage));
    if ($page > $totalPages) $page = $totalPages;

    $campaigns = $db->table('campaigns')
        ->orderBy('id', 'DESC')
        ->limit($perPage, ($page - 1) * $perPage)
        ->get()
        ->getResult();

SELECT *
FROM `donations`
WHERE `id` = '5'
UPDATE `donations` SET `status` = 'approved'
WHERE `id` = '5'
UPDATE `campaigns` SET `current_amount` = current_amount + 50.00
WHERE `id` = '10'
---
public function approve($id)
{
    $db = \Config\Database::connect();

    // get donation
    $donation = $db->table('donations')
                   ->where('id', $id)
                   ->get()
                   ->getRow();

    if(!$donation){
        return redirect()->to(base_url('admin/donations'));
    }

    // update donation status
    $db->table('donations')
       ->where('id', $id)
       ->update(['status' => 'approved']);

    // add amount to campaign total
    $db->table('campaigns')
       ->set('current_amount', 'current_amount + '.$donation->amount, false)
       ->where('id', $donation->campaign_id)
       ->update();