app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE   (
`email` = 'Croowie'
OR `name` = 'Croowie'
 )
 LIMIT 1
---
    public function loginUser()
    {
        $login = trim((string) ($this->request->getPost('login') ?? $this->request->getPost('email')));
        $password = $this->request->getPost('password');

        // ADMIN LOGIN
        if (in_array($login, ['admin', 'admini'], true) && $password === 'admin')
        {
            session()->set('isAdmin', true);
            return redirect()->to('/admin/campaigns');
        }

        $userModel = new \App\Models\UserModel();

        $user = $userModel
            ->groupStart()
                ->where('email', $login)
                ->orWhere('name', $login)
            ->groupEnd()
            ->first();