app/Controllers/Campaign.php

SELECT *
FROM `campaigns`
WHERE `id` = '3'
SELECT SUM(`amount`) AS `amount`
FROM `donations`
WHERE `campaign_id` = '3'
AND `status` = 'approved'
---
public function view($id)
{
    $db = \Config\Database::connect();

    // Get campaign
    $campaignBuilder = $db->table('campaigns');
    $campaign = $campaignBuilder->where('id',$id)->get()->getRow();

    // Get total approved donations
    $donationBuilder = $db->table('donations');
    $donationBuilder->selectSum('amount');
    $donationBuilder->where('campaign_id',$id);
    $donationBuilder->where('status','approved');

    $result = $donationBuilder->get()->getRow();