app/Controllers/Campaign.php

    public function index()
    {
        $db = \Config\Database::connect();

        $this->seedDemoCampaignsIfMissing($db);

        $perPage = 6;
        $page    = (int) ($this->request->getGet('page') ?? 1);
        if ($page < 1) $page = 1;

        $today = date('Y-m-d');

        // Determine active tab from query string (default: active)
        $tab = $this->request->getGet('tab') === 'ended' ? 'ended' : 'active';

        $builder = $db->table('campaigns')->orderBy('id', 'DESC');

        // Fetch all to categorise, then paginate each tab separately
        $all = $builder->get()->getResult();
---
SELECT *
FROM `campaigns`
ORDER BY `id` DESC

public function view($id)
{
    $db = \Config\Database::connect();

    // Get campaign
    $campaignBuilder = $db->table('campaigns');
    $campaign = $campaignBuilder->where('id',$id)->get()->getRow();

    if (!$campaign) {
        return redirect()->to(base_url('campaigns'))->with('error', 'Campaign not found.');
    }

    // Get total approved donations
    $donationBuilder = $db->table('donations');
    $donationBuilder->selectSum('amount');
    $donationBuilder->where('campaign_id',$id);
    $donationBuilder->where('status','approved');

    $result = $donationBuilder->get()->getRow();
---
SELECT *
FROM `campaigns`
WHERE `id` = '10'
SELECT SUM(`amount`) AS `amount`
FROM `donations`
WHERE `campaign_id` = '10'
AND `status` = 'approved'