app/Controllers/Donation.php

SELECT *
FROM `campaigns`
WHERE `id` = '3'
---
public function index($id)
{
    $db = \Config\Database::connect();

    $builder = $db->table('campaigns');
    $builder->where('id', $id);

    $campaign = $builder->get()->getRow();

INSERT INTO `donations` (`campaign_id`, `donor_name`, `amount`, `payment_method`, `reference_number`, `proof`, `status`) VALUES ('3', 'Test Donor 2', '300', 'GCash', '2342343', '1773332567_fcd51ce196e6d8151e6e.png', 'pending')
---
public function save()
{
    $db = \Config\Database::connect();

    $campaign_id = $this->request->getPost('campaign_id');
    $amount = $this->request->getPost('amount');

    $file = $this->request->getFile('proof');
    $proofName = null;

    if ($file && $file->isValid() && !$file->hasMoved())
    {
        $proofName = $file->getRandomName();
        $file->move('uploads', $proofName);
    }

    $data = [
        'campaign_id' => $campaign_id,
        'donor_name' => $this->request->getPost('donor_name'),
        'amount' => $amount,
        'payment_method' => 'GCash',
        'reference_number' => $this->request->getPost('reference'),
        'proof' => $proofName,
        'status' => 'pending'
    ];

    $db->table('donations')->insert($data);