app/Controllers/Home.php

SELECT *
FROM `campaigns`
---
public function index()
{

$db = \Config\Database::connect();

$builder = $db->table('campaigns');

$data['campaigns'] = $builder->get()->getResult();